[{"displayName":"Building great relationships","description":"• Being a great colleague and working effectively as part of a team<br/>• Being able to clearly articulate your view and share with others (and do this in an effective way)<br/>• Use a range of communication mediums e.g. presentations, pitches, written comms (blogs)<br/>• Being able to influence<br/>• Giving and receiving feedback effectively<br/>• Speak up about things that aren&apos;t right e.g. inappropriate behaviour<br/>• Understanding when to escalate or ask for help<br/>• Representing IW; ambassadorship","movieQuote":"Be excellent to each other","milestones":[{"summary":"","advSummary":"","signals":"Getting to know your team mates and being yourself","examples":"• Engage in two way, collaborative effective discussion whilst pairing with others<br/>• Ask questions to clarify understanding<br/>• Contribute effectively in meetings, knowing when to speak up and when to listen<br/>• Use clear and effective written information to support your work","advSignals":"Expanding your network and confidence wider than your team<br/>","advExamples":"• Ask questions to explore the client&apos;s view<br/>• Explain your thinking on a topic to the client<br/>• Ask questions to provoke thought and challenge the team<br/>• Write blogs (or similar) on key learnings"},{"summary":"","advSummary":"","signals":"You&apos;ve become an effective IW colleague within your team","examples":"• Be conscious of allowing colleagues to make their point<br/>• Use a friendly and engaging manner to help others feel at ease<br/>• You can contribute to the team&apos;s decision making","advSignals":"Your network and influence is widening out beyond the team level","advExamples":"• Draw out opinions from colleagues through open questions<br/>• Work out the best way to phrase (and re-phrase) your thoughts to help others understand, both verbally and in writing"},{"summary":"","advSummary":"","signals":"Establishing yourself as a valued consultant for IW (and the client), having empathy with a wider group","examples":"• Organise sessions with the team and client to discuss and decide on key topics","advSignals":"Widening your IW (and client) consultancy impact","advExamples":"• Provide information in an understandable format for both technical and non-technical audiences<br/>• Use facilitation techniques to help keep workshops and meetings productive, e.g. set agenda, timebox discussions, set a goal for the meeting and don&apos;t let it end without a list of actions"},{"summary":"","advSummary":"","signals":"Adapt your own style to be able to build relationships with a diverse range of people","examples":"• Use data to support people who are analytical in style, or storytelling for those who are more emotive<br/>• Vary your approach and techniques dependent on the client situation<br/>• Able to build relationships with people at Director level","advSignals":"Able to build strong relationships with external senior people","advExamples":"• Read the situation and reactions of both yourself and others and adapt accordingly to aim for the best outcomes<br/>• Thinking about your current network and who you should build relationships with to help us be successful"},{"summary":"","advSummary":"","signals":"Taking on the lead relationship role for an area significant in size or complexity","examples":"• Tailor your communication and how you influence for different levels of client engagement, from board down","advSignals":"Recognised as a thought leader for your specialism and an IW ambassador","advExamples":"• Speak and network at large conferences<br/>• Present and participate in client board meetings<br/>• Facilitate challenging sessions with the aim of arriving at a clear outcome"}]},{"displayName":"Figuring stuff out","description":"• Analyses the situation to extract a clear and simple understanding of what needs to be done.<br/>• Practices continuous improvement<br/>• Adapts to change<br/>• Is results oriented<br/>• Is not daunted by a challenge<br/>• Is open minded<br/>• Not afraid to fail and learn","movieQuote":"Pop quiz, hotshot!","milestones":[{"summary":"","advSummary":"","signals":"Delivers small and well-defined tasks<br/>","examples":"• Take a well-understood task through elaboration and implementation with minimal support<br/>• Understands well-formed requirements<br/>• Applies previous experience to solve similar problems<br/>• Fills in minor gaps in specification, applying common sense<br/>• Asks for help when stuck and able to follow through if given guidance specific to problem","advSignals":"Takes on problems with a higher degree of complexity and ambiguity in requirements<br/>","advExamples":"• Understands what needs to be done based on brief and vague requirements<br/>• Uses novel combinations of previous experience to solve somewhat new problems <br/>• Fills in more significant gaps in specification, applying common sense <br/>• Asks for help when stuck and applies general guidance to specific problem"},{"summary":"","advSummary":"","signals":"Tackles larger challenges, understanding what needs to be done","examples":"• Understands what needs to be done for larger tasks (e.g. taking several days) and thinks through them clearly without being daunted by the task<br/>• Splits up the work into logical chunks and works through them systematically<br/>• Challenges unclear or poorly-formed requirements and asks appropriate questions to get clarity on what&apos;s needed<br/>• Starting to form opinions which inform how problems are solved<br/>• May identify specific issues at a company level without necessarily knowing how to solve them","advSignals":"Takes more ownership of problems and begins to offer alternative solutions","advExamples":"• Plays an active part in designing the solution to achieve the goals for larger tasks (e.g. taking several days)<br/>• Helps others understand tasks like this so they can deliver them effectively<br/>• Has clear opinions which are applied when comparing solution options but may sometimes get blinkered and fail to adequately explore alteratives<br/>• Proposes reasonable adjustments or alternatives to the given business requirements, when needed, to avoid spending undue effort on unimportant things<br/>• Involved with prioritising tasks and determining the best order to deliver them<br/>"},{"summary":"","advSummary":"","signals":"Leading larger tasks","examples":"• Leads the definition and specification of larger tasks for self and others<br/>• Heavily involved in the solution design to achieve the task goals<br/>• Identifies when larger tasks should be split or merged to better represent how they can be delivered effectively","advSignals":"Leads on complex team challenges","advExamples":"• Leads the definition and specification of larger tasks for self and others<br/>• Leads parts of the overall project solution design<br/>• Plays an active role in maintaining the team delivery plan in the face of changing circumstances<br/>• Helps the team understand and align around the overall solution design and delivery plan<br/>• Plays an active role in the identification and resolution of risks, issues, dependencies"},{"summary":"","advSummary":"","signals":"Owns forming or fixing projects","examples":"• Leads the formation of the initial solution design and delivery plan for new projects<br/>• Leads identification and resolution of risks, issues, dependencies<br/>• Uses awareness of other projects to identify impacts and influences between them<br/>• Identifies issues with in-flight projects and puts in place changes to the solution design and delivery plan to address them","advSignals":"Plays a key role in solving complex, company-wide problems","advExamples":"• Works in some capacity across multiple teams<br/>• Leads an area of change such as reworking aspects of how we do recruitment<br/>• Leads the development of a new company capability (e.g. service design)<br/>• Actively supports and challenges other leaders"},{"summary":"","advSummary":"","signals":"Takes ownership of problems that are both complex and large in scale","examples":"• Works across a region<br/>• Leads a significant change such as introducing a new way of working which will affect a large number of people<br/>• Plays a key role in supporting and challenging leaders throughout a region","advSignals":"Takes a leading role, company wide","advExamples":"• Works across multiple regions<br/>• Plays a key role in supporting and challenging leaders throughout the company"}]},{"displayName":"Leading the IW way","description":"• Not criticising people for mistakes<br/>• Ambassadorship<br/>• Inclusivity<br/>• Develop and care about team and peers<br/>• Sharing and celebrating team successes<br/>• Leading by example<br/>• Helping motivate and align people to a goal<br/>• Best for client<br/>• Insist on and help others achieve the highest standards<br/>• Deliver results","movieQuote":"I can only show you the door. You’re the one that has to walk through it","milestones":[{"summary":"","advSummary":"","signals":"Being honest and taking responsibility for your actions.","examples":"","advSignals":"Becoming comfortable with being you in an increasing number of situations, taking on personal ownership","advExamples":"• Try out leading meetings<br/>• Lead on smaller things"},{"summary":"","advSummary":"","signals":"Building emotional intelligence, being a good team player and colleague","examples":"","advSignals":"Empowering your team mates","advExamples":"• Work ethic = dedication to getting tasks done, taking responsibility rather than longer hours"},{"summary":"","advSummary":"","signals":"Taking responsibility beyond yourself, sharing your knowledge and mentoring others","examples":"• Implementing adoption of unit testing within your client team","advSignals":"Aligning a group to a cause, operating openly and transparently.","advExamples":"• Implementing adoption of unit testing across multiple client teams"},{"summary":"","advSummary":"","signals":"Becoming an egoless servant leader, widening your influence,  taking and owning difficult decisions","examples":"• Implementing adoption of unit testing across multiple client teams","advSignals":"Taking accountability at scale and being the leader that people turn to","advExamples":""},{"summary":"","advSummary":"","signals":"Providing and creating shared vision and strategy at scale, and bringing people along","examples":"","advSignals":"Leading throughout the company","advExamples":""}]},{"displayName":"Developing Infinity Works","description":"• Focused on Customer outcomes<br/>• Treating IW money as your own<br/>• Taking an interest in my client&apos;s business and the challenges they are facing<br/>• Bridge the gap between client challenges and IW offerings to seed new business opportunities<br/>• Bringing the best of IW to our clients<br/>• Negotiation skills<br/>• Being able to understand and manage risk<br/>• Understanding the Consulting Business Model and how we manage the business e.g. rate cards, margin, costs<br/>","movieQuote":"If you build it, they will come","milestones":[{"summary":"","advSummary":"","signals":"You understand the basics of our business and what makes IW successful.","examples":"• Complete timesheets when requested, ensuring these are completed with care to avoid mistakes<br/>• When making a request for funding e.g. project event, I have asked myself the question &quot;would I spend my own money on this, is it good value?&quot;<br/><br/><br/>","advSignals":"You see how IW fits into the wider external market and understand who our customers and competitors are.","advExamples":""},{"summary":"","advSummary":"","signals":"You can explain the value IW brings to our customers and what our competitive position is.","examples":"• Could describe the different IW service offerings to a colleague<br/>• Could deliver a short talk about your client and the objectives project<br/>• Make suggestions on how to be more cost effective, recognising that money spent on one thing means it can&apos;t be spent on another<br/>","advSignals":"You can demonstrate how your decisions and actions have led to improved efficiency for IW and/or the customer","advExamples":""},{"summary":"","advSummary":"","signals":"When you make decisions, you are mindful of the interdependencies both across IW and externally and understand the implications of your decisions on growth and profitability.","examples":"• Being able to deliver an elevator pitch on IW Service Offerings<br/>• Ensuring timesheet approvals are completed on time","advSignals":"You have a growing awareness of business risk and can support with growth opportunities","advExamples":""},{"summary":"","advSummary":"","signals":"Growing responsibility for commercial and financial aspects, leading on all aspects within your sphere of influence with a short to medium term focus.","examples":"","advSignals":"With a solid understanding of the drivers of growth and profitability for IW, you lead on longer term planning.","advExamples":""},{"summary":"","advSummary":"","signals":"A trusted advisor internally, you explore new markets and devise appropriate performance measures for teams/functions to drive growth.","examples":"","advSignals":"You formulate longer term strategic plans for IW, using your deep insight from analysis of internal and external data to inform these.","advExamples":""}]},{"displayName":"Embracing change and ambiguity","description":"• Ability to be pragmatic and handle failure<br/>• Not throwing your toys out of the pram<br/>• Strong opinion, loosely held (Egoless)<br/>• Demonstrating staying power<br/>• Take actions to build my mental and emotional resilience<br/>• Bias for action<br/>• Iterate<br/>","movieQuote":"We are but dust in the wind, dude","milestones":[{"summary":"","advSummary":"","signals":"Responds positively to changing and emerging priorities","examples":"• Asking for help from your Account Lead or Advocate if you are struggling on your project for any reason","advSignals":"Accepting of new and different ideas and approaches","advExamples":"• Don&apos;t fixate on failure, accept defeat and focus on the future"},{"summary":"","advSummary":"","signals":"Able to sustain performance and behaviour under conditions of rapid change","examples":"","advSignals":"Your focus is on how to make change work and not why it won’t","advExamples":""},{"summary":"","advSummary":"","signals":"Wearing multiple hats, accepting new situations readily.","examples":"","advSignals":"Supporting peers in dealing with change","advExamples":""},{"summary":"","advSummary":"","signals":"Demonstrate persistence towards achieving a goal in changing circumstances","examples":"","advSignals":"Can sustain performance of self and others during highly pressured, changing situations.","advExamples":""},{"summary":"","advSummary":"","signals":"Can shape change, create a shared vision and find solutions where no precedent exists","examples":"","advSignals":"Over to you ;-)","advExamples":""}]},{"displayName":"Thinking differently","description":"• Generating ideas<br/>• Apply creativity to critical thinking<br/>• Being curious<br/>• Thinking outside the box<br/>• Systhesising and reorganising information in the search for better outcomes<br/>• Being willing to try something new<br/>• Continuous improvement, both yourself and Infinity Works<br/>• Developing thought leadership<br/>• Intelligent risk taking<br/>• Invent and simplify","movieQuote":"Roads? Where we&apos;re going we don&apos;t need roads","milestones":[{"summary":"","advSummary":"","signals":"Come up with multiple approaches for yourself","examples":"• Create a list of options and test out each one<br/>• Put forward ideas to improve within team sessions such as retros<br/>• Ask good questions to explore what others think","advSignals":"Share your ideas with others","advExamples":"• Engage in conversations with colleagues to generate ideas and approaches to try<br/>• Summarise the different options and weigh these up objectively"},{"summary":"","advSummary":"","signals":"Generate ideas to help improve your team and be comfortable with change","examples":"• Seed in ideas in response to things both you and the team identify<br/>• Explain your improvements in a clear and concise way","advSignals":"Your ideas and creativity have benefited your team and colleagues in a tangible way</br>","advExamples":"• Take on a task or requested outcome and own generating various options to achieve it"},{"summary":"","advSummary":"","signals":"You generate experiments and solutions to help in a wider context (either client or IW)<br/>","examples":"• Take a specific client or IW challenge and come up with options to improve it<br/>• Try out these ideas and learn from their implementation","advSignals":"Your ideas and experiments are changing the status quo in a wider context. You&apos;re able to help others do so too<br/>","advExamples":"• Lead sessions for the team to brainstorm ideas and approaches<br/>• Challenge the status quo and own improvements through to completion"},{"summary":"","advSummary":"","signals":"Your innovation and creativity is bringing real benefits to your client or area within IW<br/>","examples":"• Track a roadmap of experiments and improvements made for your team/client","advSignals":"Improvements are being realised for IW<br/>","advExamples":""},{"summary":"","advSummary":"","signals":"You provide leadership to develop a culture of creativity and innovation<br/>","examples":"","advSignals":"Innovation and creativity are things you are reknowned for within your industry and career<br/>","advExamples":""}]}]